photo/app/controllers/komentarze_controller.rb

  def create
    @zdjecie = Zdjecie.find(params[:zdjecie_id])
    @komentarz = @zdjecie.komentarze.create!(params[:komentarz])
---
INSERT INTO "komentarze" ("created_at", "autor", "tresc", "updated_at", "zdjecie_id") VALUES('2010-04-11 10:11:10', 'Sławek', 'Pierwszy komentarz.', '2010-04-11 10:11:10', NULL)