photo/app/controllers/zdjecia_controller.rb

  def index
    # wyszukiwanie: wedlug tagow, potem wedlug opisow, jezeli szukana fraza nie jest pusta
    if params[:search]
      @zdjecia = Zdjecie.tagged_with(params[:search], :on => :tags)
      tag_cloud
    elsif params[:szukaj_opisu]
      if params[:szukaj_opisu].length == 0
        flash[:notice] = "Nie znaleziono żadnego zdjęcia, należy wpisać jakiś tekst do wyszukiwarki!"
        redirect_to root_path
      end
      @zdjecia = Zdjecie.find(:all, :conditions => [ "opis LIKE ?","%" + params[:szukaj_opisu] +"%"])
---
SELECT tags.*, COUNT(*) AS count FROM "tags" LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN zdjecia ON zdjecia.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Zdjecie') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

  def show
    @zdjecie = Zdjecie.find(params[:id])
    @komentarze = @zdjecie.komentarze.all
---
SELECT * FROM "komentarze" WHERE ("komentarze".zdjecie_id = 2)